topologie.org
     #+TITLE:       TP note reseaux
     #+AUTHOR:      Willian Ver Valen Paiva , Alexander Danzer

* ADRESSAGE

** question 1 :

Les adresses dont tous les bits sont égaux à 1 sont utilisés pour le broadcast
et tous ceux qui sont égaux à 0 sont utilisés pour identifier le réseau



** question 2 :

Il s'agit d'un réseau de classe B


** question 3

Le marketing possède 8 sous-réseaux pour chaque département, et chacun d'entre eux
possède 15 sous-sous réseaux pour chaque pièce ;
la R&D a 2 sous-réseaux, l'un qui possède 6 sous-sous réseaux pour  pour chaque équipe et l'un qui n'a pas
de sous-sous réseau.
Le test a 15 sous-réseaux ;
la production n'a pas de sous-réseau.


** question 4
Nous avons besoin de 2 bits pour adresser les sous-réseaux, et de 14 pour adresser une
machine sur un sous-réseau (voir la question 3 pour les détails)



| a | b | c | d | e | f | g | h | . | i | j | k | l | m | n | o | p |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | . | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |

Nous utilisons les bits "a" et "b" pour diviser les pôles



Masque de sous-réseau= 255.255..0
+--------------+--------------+----------------+----------------+------------+
|      network |         from |             to |      broadcast | pole       |
+--------------+--------------+----------------+----------------+------------+
|   172.16.0.0 |   172.16.0.1 |  172.16.63.254 |  172.16.63.255 | Marketing  |
+--------------+--------------+----------------+----------------+------------+
|  172.16.64.0 |  172.16.64.1 | 172.16.127.254 | 172.16.127.255 | R and D    |
+--------------+--------------+----------------+----------------+------------+
| 172.16.128.0 | 172.16.128.1 | 172.16.191.254 | 172.16.191.255 | support    |
+--------------+--------------+----------------+----------------+------------+
| 172.16.192.0 | 172.16.192.1 | 172.16.255.254 | 172.16.255.255 | production |
+--------------+--------------+----------------+----------------+------------+


** question 5 , 6 & 7

Pour adresser les 8 départements, il nous faut un total de 3 bits et pour adresser
12 bureaux, il nous faut 4 bits.


| a | b | c | d | e | f | g | h | . | i | j | k | l | m | n | o | p |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | . | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |


Nous utilisons les bits "c", "d" et "e" pour diviser chaque département : cela laisse
la possibiité d'avoir 8 départements.



+-------------+------------+---------------+---------------+-------------+
|     network |       from |            to |     broadcast | departments |
+-------------+------------+---------------+---------------+-------------+
|  172.16.0.0 | 172.16.0.1 |  172.16.7.254 |  172.16.7.255 |           1 |
+-------------+------------+---------------+---------------+-------------+
|  172.16.8.0 | 172.16.0.1 | 172.16.15.254 | 172.16.15.255 |           2 |
+-------------+------------+---------------+---------------+-------------+
| 172.16.16.0 | 172.16.0.1 | 172.16.23.254 | 172.16.23.255 |           3 |
+-------------+------------+---------------+---------------+-------------+
| 172.16.24.0 | 172.16.0.1 | 172.16.31.254 | 172.16.31.255 |           4 |
+-------------+------------+---------------+---------------+-------------+
| 172.16.32.0 | 172.16.0.1 | 172.16.39.254 | 172.16.39.255 |           5 |
+-------------+------------+---------------+---------------+-------------+
| 172.16.40.0 | 172.16.0.1 | 172.16.47.254 | 172.16.47.255 |           6 |
+-------------+------------+---------------+---------------+-------------+
| 172.16.48.0 | 172.16.0.1 | 172.16.55.254 | 172.16.55.255 |           7 |
+-------------+------------+---------------+---------------+-------------+
| 172.16.56.0 | 172.16.0.1 | 172.16.63.254 | 172.16.63.255 |           8 |
+-------------+------------+---------------+---------------+-------------+




| a | b | c | d | e | f | g | h | . | i | j | k | l | m | n | o | p |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | . | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |


Nous utilisons les bits "f", "g" "h" "i" pour diviser les bureaux, ce qui
offre la possibilité de 125 machines par bureau.



*** département 1

+--------------+--------------+--------------+--------------+-------+
|      network |         from |           to |    broadcast | rooms |
+--------------+--------------+--------------+--------------+-------+
|   172.16.0.0 |   172.16.0.1 | 172.16.0.126 | 172.16.0.127 |     1 |
+--------------+--------------+--------------+--------------+-------+
| 172.16.0.128 | 172.16.0.129 | 172.16.0.254 | 172.16.0.255 |     2 |
+--------------+--------------+--------------+--------------+-------+
|   172.16.1.0 |   172.16.1.1 | 172.16.1.126 | 172.16.1.127 |     3 |
+--------------+--------------+--------------+--------------+-------+
| 172.16.1.128 | 172.16.1.129 | 172.16.1.254 | 172.16.1.255 |     4 |
+--------------+--------------+--------------+--------------+-------+
|   172.16.2.0 |   172.16.2.1 | 172.16.2.126 | 172.16.2.127 |     5 |
+--------------+--------------+--------------+--------------+-------+
| 172.16.2.128 | 172.16.2.129 | 172.16.2.254 | 172.16.2.255 |     6 |
+--------------+--------------+--------------+--------------+-------+
|   172.16.3.0 |   172.16.3.1 | 172.16.3.126 | 172.16.3.127 |     7 |
+--------------+--------------+--------------+--------------+-------+
| 172.16.3.128 | 172.16.3.129 | 172.16.3.254 | 172.16.3.255 |     8 |
+--------------+--------------+--------------+--------------+-------+
|   172.16.4.0 |   172.16.4.1 | 172.16.4.126 | 172.16.4.127 |     9 |
+--------------+--------------+--------------+--------------+-------+
| 172.16.4.128 | 172.16.4.129 | 172.16.4.254 | 172.16.4.255 |    10 |
+--------------+--------------+--------------+--------------+-------+
|   172.16.5.0 |   172.16.5.1 | 172.16.5.126 | 172.16.5.127 |    11 |
+--------------+--------------+--------------+--------------+-------+
| 172.16.5.128 | 172.16.5.129 | 172.16.5.254 | 172.16.5.255 |    12 |
+--------------+--------------+--------------+--------------+-------+
|   172.16.6.0 |   172.16.6.1 | 172.16.6.126 | 172.16.6.127 |    13 |
+--------------+--------------+--------------+--------------+-------+
| 172.16.6.128 | 172.16.6.129 | 172.16.6.254 | 172.16.6.255 |    14 |
+--------------+--------------+--------------+--------------+-------+
|   172.16.7.0 |   172.16.7.1 | 172.16.7.126 | 172.16.7.127 |    15 |
+--------------+--------------+--------------+--------------+-------+
| 172.16.7.128 | 172.16.7.129 | 172.16.7.254 | 172.16.7.255 |    16 |
+--------------+--------------+--------------+--------------+-------+

