topologie.tex

\subsubsection{département 2}
\label{sec:orgheadline6}

\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & rooms \\
\hline
172.16.8.0 & 172.16.8.1 & 172.16.8.126 & 172.16.8.127 & 1 \\
\hline
172.16.8.128 & 172.16.8.129 & 172.16.8.254 & 172.16.8.255 & 2 \\
\hline
172.16.9.0 & 172.16.9.1 & 172.16.9.126 & 172.16.9.127 & 3 \\
\hline
172.16.9.128 & 172.16.9.129 & 172.16.9.254 & 172.16.9.255 & 4 \\
\hline
172.16.10.0 & 172.16.10.1 & 172.16.10.126 & 172.16.10.127 & 5 \\
\hline
172.16.10.128 & 172.16.10.129 & 172.16.10.254 & 172.16.10.255 & 6 \\
\hline
172.16.11.0 & 172.16.11.1 & 172.16.11.126 & 172.16.11.127 & 7 \\
\hline
172.16.11.128 & 172.16.11.129 & 172.16.11.254 & 172.16.11.255 & 8 \\
\hline
172.16.12.0 & 172.16.12.1 & 172.16.12.126 & 172.16.12.127 & 9 \\
\hline
172.16.12.128 & 172.16.12.129 & 172.16.12.254 & 172.16.12.255 & 10 \\
\hline
172.16.13.0 & 172.16.13.1 & 172.16.13.126 & 172.16.13.127 & 11 \\
\hline
172.16.13.128 & 172.16.13.129 & 172.16.13.254 & 172.16.13.255 & 12 \\
\hline
172.16.14.0 & 172.16.14.1 & 172.16.14.126 & 172.16.14.127 & 13 \\
\hline
172.16.14.128 & 172.16.14.129 & 172.16.14.254 & 172.16.14.255 & 14 \\
\hline
172.16.15.0 & 172.16.15.1 & 172.16.15.126 & 172.16.15.127 & 15 \\
\hline
172.16.15.128 & 172.16.15.129 & 172.16.15.254 & 172.16.15.255 & 16 \\
\hline
\end{tabular}
\end{center}

\subsubsection{département 3}
\label{sec:orgheadline7}

\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & rooms \\
\hline
172.16.16.0 & 172.16.16.1 & 172.16.16.126 & 172.16.16.127 & 1 \\
\hline
172.16.16.128 & 172.16.16.129 & 172.16.16.254 & 172.16.16.255 & 2 \\
\hline
172.16.17.0 & 172.16.17.1 & 172.16.17.126 & 172.16.17.127 & 3 \\
\hline
172.16.17.128 & 172.16.17.129 & 172.16.17.254 & 172.16.17.255 & 4 \\
\hline
172.16.18.0 & 172.16.18.1 & 172.16.18.126 & 172.16.18.127 & 5 \\
\hline
172.16.18.128 & 172.16.18.129 & 172.16.18.254 & 172.16.18.255 & 6 \\
\hline
172.16.19.0 & 172.16.19.1 & 172.16.19.126 & 172.16.19.127 & 7 \\
\hline
172.16.19.128 & 172.16.19.129 & 172.16.19.254 & 172.16.19.255 & 8 \\
\hline
172.16.20.0 & 172.16.20.1 & 172.16.20.126 & 172.16.20.127 & 9 \\
\hline
172.16.20.128 & 172.16.20.129 & 172.16.20.254 & 172.16.20.255 & 10 \\
\hline
172.16.21.0 & 172.16.21.1 & 172.16.21.126 & 172.16.21.127 & 11 \\
\hline
172.16.21.128 & 172.16.21.129 & 172.16.21.254 & 172.16.21.255 & 12 \\
\hline
172.16.22.0 & 172.16.22.1 & 172.16.22.126 & 172.16.22.127 & 13 \\
\hline
172.16.22.128 & 172.16.22.129 & 172.16.22.254 & 172.16.22.255 & 14 \\
\hline
172.16.23.0 & 172.16.23.1 & 172.16.23.126 & 172.16.23.127 & 15 \\
\hline
172.16.23.128 & 172.16.23.129 & 172.16.23.254 & 172.16.23.255 & 16 \\
\hline
\end{tabular}
\end{center}

\subsubsection{département 4}
\label{sec:orgheadline8}

\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & rooms \\
\hline
172.16.24.0 & 172.16.24.1 & 172.16.24.126 & 172.16.24.127 & 1 \\
\hline
172.16.24.128 & 172.16.24.129 & 172.16.24.254 & 172.16.24.255 & 2 \\
\hline
172.16.25.0 & 172.16.25.1 & 172.16.25.126 & 172.16.25.127 & 3 \\
\hline
172.16.25.128 & 172.16.25.129 & 172.16.25.254 & 172.16.25.255 & 4 \\
\hline
172.16.26.0 & 172.16.26.1 & 172.16.26.126 & 172.16.26.127 & 5 \\
\hline
172.16.26.128 & 172.16.26.129 & 172.16.26.254 & 172.16.26.255 & 6 \\
\hline
172.16.27.0 & 172.16.27.1 & 172.16.27.126 & 172.16.27.127 & 7 \\
\hline
172.16.27.128 & 172.16.27.129 & 172.16.27.254 & 172.16.27.255 & 8 \\
\hline
172.16.28.0 & 172.16.28.1 & 172.16.28.126 & 172.16.28.127 & 9 \\
\hline
172.16.28.128 & 172.16.28.129 & 172.16.28.254 & 172.16.28.255 & 10 \\
\hline
172.16.29.0 & 172.16.29.1 & 172.16.29.126 & 172.16.29.127 & 11 \\
\hline
172.16.29.128 & 172.16.29.129 & 172.16.29.254 & 172.16.29.255 & 12 \\
\hline
172.16.30.0 & 172.16.30.1 & 172.16.30.126 & 172.16.30.127 & 13 \\
\hline
172.16.30.128 & 172.16.30.129 & 172.16.30.254 & 172.16.30.255 & 14 \\
\hline
172.16.31.0 & 172.16.31.1 & 172.16.31.126 & 172.16.31.127 & 15 \\
\hline
172.16.31.128 & 172.16.31.129 & 172.16.31.254 & 172.16.31.255 & 16 \\
\hline
\end{tabular}
\end{center}

\subsubsection{département 5}
\label{sec:orgheadline9}

\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & rooms \\
\hline
172.16.32.0 & 172.16.32.1 & 172.16.32.126 & 172.16.32.127 & 1 \\
\hline
172.16.32.128 & 172.16.32.129 & 172.16.32.254 & 172.16.32.255 & 2 \\
\hline
172.16.33.0 & 172.16.33.1 & 172.16.33.126 & 172.16.33.127 & 3 \\
\hline
172.16.33.128 & 172.16.33.129 & 172.16.33.254 & 172.16.33.255 & 4 \\
\hline
172.16.34.0 & 172.16.34.1 & 172.16.34.126 & 172.16.34.127 & 5 \\
\hline
172.16.34.128 & 172.16.34.129 & 172.16.34.254 & 172.16.34.255 & 6 \\
\hline
172.16.35.0 & 172.16.35.1 & 172.16.35.126 & 172.16.35.127 & 7 \\
\hline
172.16.35.128 & 172.16.35.129 & 172.16.35.254 & 172.16.35.255 & 8 \\
\hline
172.16.36.0 & 172.16.36.1 & 172.16.36.126 & 172.16.36.127 & 9 \\
\hline
172.16.36.128 & 172.16.36.129 & 172.16.36.254 & 172.16.36.255 & 10 \\
\hline
172.16.37.0 & 172.16.37.1 & 172.16.37.126 & 172.16.37.127 & 11 \\
\hline
172.16.37.128 & 172.16.37.129 & 172.16.37.254 & 172.16.37.255 & 12 \\
\hline
172.16.38.0 & 172.16.38.1 & 172.16.38.126 & 172.16.38.127 & 13 \\
\hline
172.16.38.128 & 172.16.38.129 & 172.16.38.254 & 172.16.38.255 & 14 \\
\hline
172.16.39.0 & 172.16.39.1 & 172.16.39.126 & 172.16.39.127 & 15 \\
\hline
172.16.39.128 & 172.16.39.129 & 172.16.39.254 & 172.16.39.255 & 16 \\
\hline
\end{tabular}
\end{center}
