topologie.tex

\subsubsection{département 6}
\label{sec:orgheadline10}

\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & rooms \\
\hline
172.16.40.0 & 172.16.40.1 & 172.16.40.126 & 172.16.40.127 & 1 \\
\hline
172.16.40.128 & 172.16.40.129 & 172.16.40.254 & 172.16.40.255 & 2 \\
\hline
172.16.41.0 & 172.16.41.1 & 172.16.41.126 & 172.16.41.127 & 3 \\
\hline
172.16.41.128 & 172.16.41.129 & 172.16.41.254 & 172.16.41.255 & 4 \\
\hline
172.16.42.0 & 172.16.42.1 & 172.16.42.126 & 172.16.42.127 & 5 \\
\hline
172.16.42.128 & 172.16.42.129 & 172.16.42.254 & 172.16.42.255 & 6 \\
\hline
172.16.43.0 & 172.16.43.1 & 172.16.43.126 & 172.16.43.127 & 7 \\
\hline
172.16.43.128 & 172.16.43.129 & 172.16.43.254 & 172.16.43.255 & 8 \\
\hline
172.16.44.0 & 172.16.44.1 & 172.16.44.126 & 172.16.44.127 & 9 \\
\hline
172.16.44.128 & 172.16.44.129 & 172.16.44.254 & 172.16.44.255 & 10 \\
\hline
172.16.45.0 & 172.16.45.1 & 172.16.45.126 & 172.16.45.127 & 11 \\
\hline
172.16.45.128 & 172.16.45.129 & 172.16.45.254 & 172.16.45.255 & 12 \\
\hline
172.16.46.0 & 172.16.46.1 & 172.16.46.126 & 172.16.46.127 & 13 \\
\hline
172.16.46.128 & 172.16.46.129 & 172.16.46.254 & 172.16.46.255 & 14 \\
\hline
172.16.47.0 & 172.16.47.1 & 172.16.47.126 & 172.16.47.127 & 15 \\
\hline
172.16.47.128 & 172.16.47.129 & 172.16.47.254 & 172.16.47.255 & 16 \\
\hline
\end{tabular}
\end{center}

\subsubsection{département 7}
\label{sec:orgheadline11}

\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & rooms \\
\hline
172.16.48.0 & 172.16.48.1 & 172.16.48.126 & 172.16.48.127 & 1 \\
\hline
172.16.48.128 & 172.16.48.129 & 172.16.48.254 & 172.16.48.255 & 2 \\
\hline
172.16.49.0 & 172.16.49.1 & 172.16.49.126 & 172.16.49.127 & 3 \\
\hline
172.16.49.128 & 172.16.49.129 & 172.16.49.254 & 172.16.49.255 & 4 \\
\hline
172.16.50.0 & 172.16.50.1 & 172.16.50.126 & 172.16.50.127 & 5 \\
\hline
172.16.50.128 & 172.16.50.129 & 172.16.50.254 & 172.16.50.255 & 6 \\
\hline
172.16.51.0 & 172.16.51.1 & 172.16.51.126 & 172.16.51.127 & 7 \\
\hline
172.16.51.128 & 172.16.51.129 & 172.16.51.254 & 172.16.51.255 & 8 \\
\hline
172.16.52.0 & 172.16.52.1 & 172.16.52.126 & 172.16.52.127 & 9 \\
\hline
172.16.52.128 & 172.16.52.129 & 172.16.52.254 & 172.16.52.255 & 10 \\
\hline
172.16.53.0 & 172.16.53.1 & 172.16.53.126 & 172.16.53.127 & 11 \\
\hline
172.16.53.128 & 172.16.53.129 & 172.16.53.254 & 172.16.53.255 & 12 \\
\hline
172.16.54.0 & 172.16.54.1 & 172.16.54.126 & 172.16.54.127 & 13 \\
\hline
172.16.54.128 & 172.16.54.129 & 172.16.54.254 & 172.16.54.255 & 14 \\
\hline
172.16.55.0 & 172.16.55.1 & 172.16.55.126 & 172.16.55.127 & 15 \\
\hline
172.16.55.128 & 172.16.55.129 & 172.16.55.254 & 172.16.55.255 & 16 \\
\hline
\end{tabular}
\end{center}

\subsubsection{département 8}
\label{sec:orgheadline12}

\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & rooms \\
\hline
\end{tabular}
\end{center}


\subsection{question  8, 9, 10 R\&D}
\label{sec:orgheadline14}


\begin{center}
\begin{tabular}{rrrrrrrrlrrrrrrrr}
a & b & c & d & e & f & g & h & . & i & j & k & l & m & n & o & p\\
\hline
0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & . & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0\\
\end{tabular}
\end{center}

Nous utilisons le bit "c" pour sub-diviser le réseau en deux (recherche,
espace de travail)


Tout d'abord nous effectuons la division pour la recherche et l'espace de travail
partagé.
\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & departments \\
\hline
172.16.64.0 & 172.16.64.1 & 172.16.95.254 & 172.16.96.255 & research \\
\hline
172.16.96.0 & 172.16.96.1 & 172.16.127.254 & 172.16.127.255 & shared workspace \\
\hline
\end{tabular}
\end{center}

La division d'équipe :


Nous utilisons les bits "d", "e", et "f" pour sub-diviser
les équipes de recherche


\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & teams \\
\hline
172.16.64.0 & 172.16.64.1 & 172.16.67.254 & 172.16.67.255 & 1 \\
\hline
172.16.68.0 & 172.16.68.1 & 172.16.71.254 & 172.16.71.255 & 2 \\
\hline
172.16.72.0 & 172.16.72.1 & 172.16.75.254 & 172.16.75.255 & 3 \\
\hline
172.16.76.0 & 172.16.76.1 & 172.16.79.254 & 172.16.79.255 & 4 \\
\hline
172.16.80.0 & 172.16.80.1 & 172.16.83.254 & 172.16.83.255 & 5 \\
\hline
172.16.84.0 & 172.16.84.1 & 172.16.87.254 & 172.16.87.255 & 6 \\
\hline
172.16.88.0 & 172.16.88.1 & 172.16.91.254 & 172.16.91.255 & 7 \\
\hline
172.16.92.0 & 172.16.92.1 & 172.16.95.254 & 172.16.95.255 & 8 \\
\hline
\end{tabular}
\end{center}


Et pour l'espace de travail, nous n'avons pas besoin de sub-division.
