topologie.tex



\subsection{question 8 , 9 , 10 Pole Test}
\label{sec:orgheadline15}


\begin{center}
\begin{tabular}{rrrrrrrrlrrrrrrrr}
a & b & c & d & e & f & g & h & . & i & j & k & l & m & n & o & p\\
\hline
0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & . & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0\\
\end{tabular}
\end{center}

Pour le pole test, nous utilisons les bits "c", "d", "e" et "f" pour sub-diviser
le réseau :


\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & team \\
\hline
172.16.128.0 & 172.16.128.1 & 172.16.131.254 & 172.16.131.255 & 1 \\
\hline
172.16.132.0 & 172.16.132.1 & 172.16.135.254 & 172.16.135.255 & 2 \\
\hline
172.16.136.0 & 172.16.136.1 & 172.16.139.254 & 172.16.139.255 & 3 \\
\hline
172.16.140.0 & 172.16.140.1 & 172.16.143.254 & 172.16.143.255 & 4 \\
\hline
172.16.144.0 & 172.16.144.1 & 172.16.147.254 & 172.16.147.255 & 5 \\
\hline
172.16.148.0 & 172.16.148.1 & 172.16.151.254 & 172.16.151.255 & 6 \\
\hline
172.16.152.0 & 172.16.152.1 & 172.16.155.254 & 172.16.155.255 & 7 \\
\hline
172.16.156.0 & 172.16.156.1 & 172.16.159.254 & 172.16.159.255 & 8 \\
\hline
172.16.160.0 & 172.16.160.1 & 172.16.163.254 & 172.16.163.255 & 9 \\
\hline
172.16.164.0 & 172.16.164.1 & 172.16.167.254 & 172.16.167.255 & 10 \\
\hline
172.16.168.0 & 172.16.168.1 & 172.16.171.254 & 172.16.171.255 & 11 \\
\hline
172.16.172.0 & 172.16.172.1 & 172.16.175.254 & 172.16.175.255 & 12 \\
\hline
172.16.176.0 & 172.16.176.1 & 172.16.179.254 & 172.16.179.255 & 13 \\
\hline
172.16.180.0 & 172.16.180.1 & 172.16.183.254 & 172.16.183.255 & 14 \\
\hline
172.16.184.0 & 172.16.184.1 & 172.16.187.254 & 172.16.187.255 & 15 \\
\hline
172.16.188.0 & 172.16.188.1 & 172.16.191.254 & 172.16.191.255 & 16 \\
\hline
\end{tabular}
\end{center}

\subsection{question 8 , 9 , 10 pole production}
\label{sec:orgheadline16}

Pour la production, nous n'avons aucune sub-division, et donc la gamme des
IP est comme suit :


\begin{center}
\begin{tabular}{|l|l|l|l|}
\hline
network & from & to & broadcast \\
\hline
172.16.192.0 & 172.16.192.1 & 172.16.255.254 & 172.16.255.255 \\
\hline
\end{tabular}
\end{center}

\section{implementation}
\label{sec:orgheadline46}

\subsection{question 1}
\label{sec:orgheadline18}
for a start we prefer to use vlan to interconnect all teams as the cost of a router for each sub netwrok would be high

\subsection{question 3}
\label{sec:orgheadline19}

Un LAN virtuel (VLAN) rend abstraite l'idée de LAN ; un VLAN pourrait comprendre un sous-ensemble des ports sur un swith unique ou des sous-ensembles
de ports sur des switches multiples. Par défaut, les systèmes sur un VLAN ne voient pas le trafic associé avec les systèmes sur d'autres VLANs dans le
même réseau.
Les VLAN permettent le regroupement logique de stations finales qui sont physiquement dispersées sur le réseau.



Lorsque les utilisateurs d'un VLAN déménagent dans un autre local physique, mais continuent à effectuer les mêmes fonctions dans leur travail, les stations
finales de ces utilisateurs n'ont pas besoind d'être reconfigurées. De même, si les utilisateurs changent de fonction, ils n'ont pas besoin de déménager
physiquement : changer l'affectation des stations physiques terminales du VLAN à celles de la nouvelle équipe rend accessible les ressources
locales pour la nouvelle équipe.
Les VLANs permettent d'éviter de déployer des routeurs pour contenir le trafic de broadcast.

Le flux de paquets est limité aux ports switch qui appartiennent à un VLAN.
Le confinement de domaines de broadcast à un réseau réduit significativement le trafic.




Arguments pour :
\begin{itemize}
\item flexibilité
\item facilité de gestion
\item indépendance de la couche physique
\item performance
\item sécurité
\item coût
\end{itemize}

Arguments contre :
\begin{itemize}
\item limite de 4094
\item complication managériale
\end{itemize}


\subsection{question 4}
\label{sec:orgheadline20}

\subsection{question 5}
\label{sec:orgheadline21}

Les VLANs sont plus adaptés lorsqu'il s'agit d'isoler chaque équipe.



\subsection{question 6}
\label{sec:orgheadline22}

\begin{verbatim}
vlan database
vlan 10 name E1
vlan 20 name E2
vlan 30 name E3
vlan 40 name E4
\end{verbatim}
\subsection{question 7}
\label{sec:orgheadline23}

\begin{verbatim}
configure
inteface fastEthernet 1/1
switchport access vlan 10
switchport mode access
no shutdown
exit

inteface fastEthernet 1/2
switchport access vlan 20
switchport mode access
no shutdown
exit

inteface fastEthernet 1/3
switchport access vlan 30
switchport mode access
no shutdown
exit

inteface fastEthernet 1/4
switchport access vlan 40
switchport mode access
no shutdown
exit
\end{verbatim}

\subsection{question 8}
\label{sec:orgheadline24}

\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
network & from & to & broadcast & team \\
\hline
172.16.128.0 & 172.16.128.1 & 172.16.131.254 & 172.16.131.255 & 1 \\
\hline
172.16.132.0 & 172.16.132.1 & 172.16.135.254 & 172.16.135.255 & 2 \\
\hline
172.16.136.0 & 172.16.136.1 & 172.16.139.254 & 172.16.139.255 & 3 \\
\hline
172.16.140.0 & 172.16.140.1 & 172.16.143.254 & 172.16.143.255 & 4 \\
\hline
\end{tabular}
\end{center}

\subsection{question 9}
\label{sec:orgheadline25}

J'ai essayé de configurer un IP mais j'ai eu le message d'erreur:
IP addresses may not be configured on L2 links.

its switch not a router

\subsection{question 10}
\label{sec:orgheadline26}
for all the pole test we need 16 ports as we are working with just 4 equipes we need 4

\subsection{question 11}
\label{sec:orgheadline27}

\begin{verbatim}
configure
interface fastEthernet 1/0
switchport trunk encapsulation dot1q
switchport mode trunk
no shutdown
exit
\end{verbatim}



\subsection{question 12}
\label{sec:orgheadline28}

\begin{verbatim}
configurer
interface fastEthernet 0/0
interface fastEthernet 0/0.10
encapsulation dot1q 10
exit

interface fastEthernet 0/0.20
encapsulation dot1q 20
exit

interface fastEthernet 0/0.30
encapsulation dot1q 30
exit


interface fastEthernet 0/0.40
encapsulation dot1q 40
exit
\end{verbatim}



\subsection{question 13}
\label{sec:orgheadline29}



\subsection{question 14}
\label{sec:orgheadline30}

\begin{verbatim}
configurer
interface fastethernet 0/0.10
ip address 172.16.128.1 255.255.252.0
no shutdown
exit

interface fastethernet 0/0.20
ip address 172.16.132.1 255.255.252.0
no shutdown
exit

interface fastethernet 0/0.30
ip address 172.16.136.1 255.255.252.0
no shutdown
exit

interface fastethernet 0/0.40
ip address 172.16.140.1 255.255.252.0
no shutdown
exit
\end{verbatim}

\subsection{question 15}
\label{sec:orgheadline35}

\subsubsection{pc1}
\label{sec:orgheadline31}

\begin{verbatim}
configure
interface fastEthernet 0/0
ip adress 172.16.128.2 255.255.252.0
no shutdown
ping 172.16.128.1
Sending 5, 100-byte ICMP Echos to 172.16.128.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 64/65/68 ms
\end{verbatim}


\subsubsection{pc2}
\label{sec:orgheadline32}

\begin{verbatim}
configure
interface fastEthernet 0/0
ip adress 172.16.132.2 255.255.252.0
no shutdown
ping 172.16.132.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.132.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 64/65/68 ms
\end{verbatim}
