topologie.org
*** pc3

#+BEGIN_EXAMPLE
configure
interface fastEthernet 0/0
ip adress 172.16.136.2 255.255.252.0
no shutdown
ping 172.16.136.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.136.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 64/65/68 ms
#+END_EXAMPLE



*** pc4

#+BEGIN_EXAMPLE
configure
interface fastEthernet 0/0
ip adress 172.16.140.2 255.255.252.0
no shutdown
ping 172.16.140.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.140.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 64/65/68 ms
#+END_EXAMPLE


** question 16
** question 17
on the package there is a champ called id where is possible to find the vlan id ;

** question 18
the id is allocated in 12 bits giving a total of 4095


** question 19
*** on the switch V1:
#+BEGIN_EXAMPLE
vlan database
vlan 50 name E5
vlan 60 name E6
exit
configure
interface fastEthernet 1/5
switchport trunk encapsulation dot1q
switchport mode trunk
no shutdown
exit
#+END_EXAMPLE

*** on the switch v2
#+BEGIN_EXAMPLE
configure
inteface fastEthernet 1/1
switchport access vlan 50
switchport mode access
no shutdown
exit

inteface fastEthernet 1/2
switchport access vlan 50
switchport mode access
no shutdown
exit

interface fastEthernet 1/0
switchport trunk encapsulation dot1q
switchport mode trunk
no shutdown
exit
#+END_EXAMPLE


*** on the router RT :
#+BEGIN_EXAMPLE
configurer
interface fastethernet 0/0.50
ip address 172.16.144.1 255.255.252.0
no shutdown
exit
interface fastethernet 0/0.60
ip address 172.16.148.1 255.255.252.0
no shutdown
exit
#+END_EXAMPLE


*** om pc 5:
#+BEGIN_EXAMPLE
configure
interface fastEthernet 0/0
ip address 172.16.144.2 255.255.252.0
no shutdown
exit
#+END_EXAMPLE


*** om pc 6:
#+BEGIN_EXAMPLE
configure
interface fastEthernet 0/0
ip address 172.16.148.2 255.255.252.0
no shutdown
exit

#+END_EXAMPLE



** ..
.Alexander Danzer, alex@dnzr.name, 0770429883:

