topologie.tex

\subsubsection{pc3}
\label{sec:orgheadline33}

\begin{verbatim}
configure
interface fastEthernet 0/0
ip adress 172.16.136.2 255.255.252.0
no shutdown
ping 172.16.136.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.136.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 64/65/68 ms
\end{verbatim}



\subsubsection{pc4}
\label{sec:orgheadline34}

\begin{verbatim}
configure
interface fastEthernet 0/0
ip adress 172.16.140.2 255.255.252.0
no shutdown
ping 172.16.140.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.140.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 64/65/68 ms
\end{verbatim}


\subsection{question 16}
\label{sec:orgheadline36}
\subsection{question 17}
\label{sec:orgheadline37}
on the package there is a champ called id where is possible to find the vlan id ;

\subsection{question 18}
\label{sec:orgheadline38}
the id is allocated in 12 bits giving a total of 4095


\subsection{question 19}
\label{sec:orgheadline44}
\subsubsection{on the switch V1:}
\label{sec:orgheadline39}
\begin{verbatim}
vlan database
vlan 50 name E5
vlan 60 name E6
exit
configure
interface fastEthernet 1/5
switchport trunk encapsulation dot1q
switchport mode trunk
no shutdown
exit
\end{verbatim}

\subsubsection{on the switch v2}
\label{sec:orgheadline40}
\begin{verbatim}
configure
inteface fastEthernet 1/1
switchport access vlan 50
switchport mode access
no shutdown
exit

inteface fastEthernet 1/2
switchport access vlan 50
switchport mode access
no shutdown
exit

interface fastEthernet 1/0
switchport trunk encapsulation dot1q
switchport mode trunk
no shutdown
exit
\end{verbatim}


\subsubsection{on the router RT :}
\label{sec:orgheadline41}
\begin{verbatim}
configurer
interface fastethernet 0/0.50
ip address 172.16.144.1 255.255.252.0
no shutdown
exit
interface fastethernet 0/0.60
ip address 172.16.148.1 255.255.252.0
no shutdown
exit
\end{verbatim}


\subsubsection{om pc 5:}
\label{sec:orgheadline42}
\begin{verbatim}
configure
interface fastEthernet 0/0
ip address 172.16.144.2 255.255.252.0
no shutdown
exit
\end{verbatim}


\subsubsection{om pc 6:}
\label{sec:orgheadline43}
\begin{verbatim}
configure
interface fastEthernet 0/0
ip address 172.16.148.2 255.255.252.0
no shutdown
exit
\end{verbatim}



\subsection{..}
\label{sec:orgheadline45}
.Alexander Danzer, alex@dnzr.name, 0770429883:
\end{document}